Revit 2026 API

# PrintSettingName Property

---

Returns the Name of Print Setup.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public override string Name { get; set; }
```
```vb
Public Overrides Property Name As String
	Get
	Set
```
```cpp
public:
virtual property String^ Name {
	String^ get () override;
	void set (String^ value) override;
}
```
```fsharp
abstract Name : string with get, set
override Name : string with get, set
```

#### Property Value

String

Retrieve/set the name of Print Setup.

#### Reference

PrintSetting Class

Autodesk.Revit.DB Namespace